<h3> Importing necessary Libraries

In [1]:
import pandas as pd
import sqlalchemy as sa
import os
from dotenv import load_dotenv

<h3> SQLAlchemy Connection Engine

In [2]:
load_dotenv()

username = os.getenv('DB_USERNAME')
password = os.getenv('DB_PASSWORD')
database = os.getenv('DB_NAME')
host = os.getenv('DB_HOST','localhost')
port = os.getenv('DB_PORT',3306)

engine = sa.create_engine(f'mysql+pymysql://{username}:{password}@{host}:{port}/{database}')

<h3> Importing CSV files

In [3]:
customer_df = pd.read_csv("customers.csv")
geolocation_df = pd.read_csv("geolocation.csv")
orderitems_df = pd.read_csv("order_items.csv")
orders_df = pd.read_csv("orders.csv")
payments_df = pd.read_csv("payments.csv")
products_df = pd.read_csv("products.csv")
sellers_df = pd.read_csv("sellers.csv")

<h3> Analyzing Customers Data

In [4]:
print(customer_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB
None

In [5]:
customer_df.head()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [6]:
customer_df.isnull().any()

customer_id                 False
customer_unique_id          False
customer_zip_code_prefix    False
customer_city               False
customer_state              False
dtype: bool

In [7]:
if customer_df.duplicated().any():
    print("There are duplicate records in customer_df")
else:
    print("There are no duplicate records in customer_df")

There are no duplicate records in customer_df

In [8]:
# Exporting customer_df to mysql database

customer_df.to_sql(name = "customers",con=engine,if_exists='replace',index=False)

99441

<h3> Analyzing GeoLocation Data

In [9]:
print(geolocation_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000163 entries, 0 to 1000162
Data columns (total 5 columns):
 #   Column                       Non-Null Count    Dtype
---  ------                       --------------    -----
 0   geolocation_zip_code_prefix  1000163 non-null  int64
 1   geolocation_lat              1000163 non-null  float64
 2   geolocation_lng              1000163 non-null  float64
 3   geolocation_city             1000163 non-null  object
 4   geolocation_state            1000163 non-null  object
dtypes: float64(2), int64(1), object(2)
memory usage: 38.2+ MB
None

In [10]:
geolocation_df.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

In [11]:
geolocation_df.isnull().any()

geolocation_zip_code_prefix    False
geolocation_lat                False
geolocation_lng                False
geolocation_city               False
geolocation_state              False
dtype: bool

In [12]:
if geolocation_df.duplicated().any():
    print("There are duplicate records in geolocation_df")
else:
    print("There are no duplicate records in geolocation_df")

There are duplicate records in geolocation_df

In [13]:
geolocation_duplicates = geolocation_df[geolocation_df.duplicated()]
geolocation_duplicates

# Dropping Duplicate values
# geolocation_duplicates.drop_duplicates(inplace=True)

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
15,1046,-23.546081,-46.644820,sao paulo,SP
44,1046,-23.546081,-46.644820,sao paulo,SP
65,1046,-23.546081,-46.644820,sao paulo,SP
66,1009,-23.546935,-46.636588,sao paulo,SP
67,1046,-23.546081,-46.644820,sao paulo,SP
...,...,...,...,...,...
1000153,99970,-28.343273,-51.873734,ciriaco,RS
1000154,99950,-28.070493,-52.011342,tapejara,RS
1000159,99900,-27.877125,-52.224882,getulio vargas,RS
1000160,99950,-28.071855,-52.014716,tapejara,RS
1000162,99950,-28.070104,-52.018658,tapejara,RS

In [14]:
geolocation_df.to_sql(name="geolocation",con=engine,if_exists='replace',index=False)

1000163

<h3> Analyzing Order Items Data

In [15]:
print(orderitems_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  object
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB
None

In [16]:
orderitems_df.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [17]:
orderitems_df.isnull().any()

order_id               False
order_item_id          False
product_id             False
seller_id              False
shipping_limit_date    False
price                  False
freight_value          False
dtype: bool

In [18]:
if orderitems_df.duplicated().any():
    print("There are duplicate records in orderitems_df")
else:
    print("There are no duplicate records in orderitems_df")

There are no duplicate records in orderitems_df

In [19]:
orderitems_df.to_sql(name="order_items",con=engine,if_exists='replace',index=False)

112650

<h3> Analyzing Orders Data

In [20]:
print(orders_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  object
 4   order_approved_at              99281 non-null  object
 5   order_delivered_carrier_date   97658 non-null  object
 6   order_delivered_customer_date  96476 non-null  object
 7   order_estimated_delivery_date  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB
None

In [21]:
orders_df.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [22]:
orders_df.isnull().any()

order_id                         False
customer_id                      False
order_status                     False
order_purchase_timestamp         False
order_approved_at                 True
order_delivered_carrier_date      True
order_delivered_customer_date     True
order_estimated_delivery_date    False
dtype: bool

In [23]:
orders_df['order_approved_at'].isnull().sum()

np.int64(160)

In [24]:
orders_df['order_approved_at'].values

array(['2017-10-02 11:07:15', '2018-07-26 03:24:27',
       '2018-08-08 08:55:23', ..., '2017-08-27 15:04:16',
       '2018-01-08 21:36:21', '2018-03-09 11:20:28'], dtype=object)

In [25]:
orders_df[orders_df['order_approved_at'].isnull()]

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
1130,00b1cb0320190ca0daa2c88b35206009,3532ba38a3fd242259a514ac2b6ae6b6,canceled,2018-08-28 15:26:39,NaN,NaN,NaN,2018-09-12 00:00:00
1801,ed3efbd3a87bea76c2812c66a0b32219,191984a8ba4cbb2145acb4fe35b69664,canceled,2018-09-20 13:54:16,NaN,NaN,NaN,2018-10-17 00:00:00
1868,df8282afe61008dc26c6c31011474d02,aa797b187b5466bc6925aaaa4bb3bed1,canceled,2017-03-04 12:14:30,NaN,NaN,NaN,2017-04-10 00:00:00
2029,8d4c637f1accf7a88a4555f02741e606,b1dd715db389a2077f43174e7a675d07,canceled,2018-08-29 16:27:49,NaN,NaN,NaN,2018-09-13 00:00:00
2161,7a9d4c7f9b068337875b95465330f2fc,7f71ae48074c0cfec9195f88fcbfac55,canceled,2017-05-01 16:12:39,NaN,NaN,NaN,2017-05-30 00:00:00
...,...,...,...,...,...,...,...,...
97696,5a00b4d35edffc56b825c3646a99ba9d,6a3bdf004ca96338fb5fad1b8d93c2e6,canceled,2017-07-02 15:38:46,NaN,NaN,NaN,2017-07-25 00:00:00
98415,227c804e2a44760671a6a5697ea549e4,62e7477e75e542243ee62a0ba73f410f,canceled,2017-09-28 15:02:56,NaN,NaN,NaN,2017-10-16 00:00:00
98909,e49e7ce1471b4693482d40c2bd3ad196,e4e7ab3f449aeb401f0216f86c2104db,canceled,2018-08-07 11:16:28,NaN,NaN,NaN,2018-08-10 00:00:00
99283,3a3cddda5a7c27851bd96c3313412840,0b0d6095c5555fe083844281f6b093bb,canceled,2018-08-31 16:13:44,NaN,NaN,NaN,2018-10-01 00:00:00
99347,a89abace0dcc01eeb267a9660b5ac126,2f0524a7b1b3845a1a57fcf3910c4333,canceled,2018-09-06 18:45:47,NaN,NaN,NaN,2018-09-27 00:00:00

In [26]:
orders_df['order_delivered_carrier_date'].isnull().sum()

np.int64(1783)

In [27]:
orders_df[orders_df['order_delivered_carrier_date'].isnull()]

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
6,136cce7faa42fdb2cefd53fdc79a6098,ed0271e0b7da060a393796590e7b737a,invoiced,2017-04-11 12:22:08,2017-04-13 13:25:17,NaN,NaN,2017-05-09 00:00:00
103,0760a852e4e9d89eb77bf631eaaf1c84,d2a79636084590b7465af8ab374a8cf5,invoiced,2018-08-03 17:44:42,2018-08-07 06:15:14,NaN,NaN,2018-08-21 00:00:00
128,15bed8e2fec7fdbadb186b57c46c92f2,f3f0e613e0bdb9c7cee75504f0f90679,processing,2017-09-03 14:22:03,2017-09-03 14:30:09,NaN,NaN,2017-10-03 00:00:00
266,8e24261a7e58791d10cb1bf9da94df5c,64a254d30eed42cd0e6c36dddb88adf0,unavailable,2017-11-16 15:09:28,2017-11-16 15:26:57,NaN,NaN,2017-12-05 00:00:00
324,d3c8851a6651eeff2f73b0e011ac45d0,957f8e082185574de25992dc659ebbc0,processing,2016-10-05 22:44:13,2016-10-06 15:51:05,NaN,NaN,2016-12-09 00:00:00
...,...,...,...,...,...,...,...,...
99283,3a3cddda5a7c27851bd96c3313412840,0b0d6095c5555fe083844281f6b093bb,canceled,2018-08-31 16:13:44,NaN,NaN,NaN,2018-10-01 00:00:00
99313,e9e64a17afa9653aacf2616d94c005b8,b4cd0522e632e481f8eaf766a2646e86,processing,2018-01-05 23:07:24,2018-01-09 07:18:05,NaN,NaN,2018-02-06 00:00:00
99347,a89abace0dcc01eeb267a9660b5ac126,2f0524a7b1b3845a1a57fcf3910c4333,canceled,2018-09-06 18:45:47,NaN,NaN,NaN,2018-09-27 00:00:00
99348,a69ba794cc7deb415c3e15a0a3877e69,726f0894b5becdf952ea537d5266e543,unavailable,2017-08-23 16:28:04,2017-08-28 15:44:47,NaN,NaN,2017-09-15 00:00:00
99415,5fabc81b6322c8443648e1b21a6fef21,32c9df889d41b0ee8309a5efb6855dcb,unavailable,2017-10-10 10:50:03,2017-10-14 18:35:57,NaN,NaN,2017-10-23 00:00:00

In [28]:
orders_df['order_delivered_customer_date'].isnull().sum()

np.int64(2965)

In [29]:
orders_df[orders_df['order_delivered_customer_date'].isnull()]

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
6,136cce7faa42fdb2cefd53fdc79a6098,ed0271e0b7da060a393796590e7b737a,invoiced,2017-04-11 12:22:08,2017-04-13 13:25:17,NaN,NaN,2017-05-09 00:00:00
44,ee64d42b8cf066f35eac1cf57de1aa85,caded193e8e47b8362864762a83db3c5,shipped,2018-06-04 16:44:48,2018-06-05 04:31:18,2018-06-05 14:32:00,NaN,2018-06-28 00:00:00
103,0760a852e4e9d89eb77bf631eaaf1c84,d2a79636084590b7465af8ab374a8cf5,invoiced,2018-08-03 17:44:42,2018-08-07 06:15:14,NaN,NaN,2018-08-21 00:00:00
128,15bed8e2fec7fdbadb186b57c46c92f2,f3f0e613e0bdb9c7cee75504f0f90679,processing,2017-09-03 14:22:03,2017-09-03 14:30:09,NaN,NaN,2017-10-03 00:00:00
154,6942b8da583c2f9957e990d028607019,52006a9383bf149a4fb24226b173106f,shipped,2018-01-10 11:33:07,2018-01-11 02:32:30,2018-01-11 19:39:23,NaN,2018-02-07 00:00:00
...,...,...,...,...,...,...,...,...
99283,3a3cddda5a7c27851bd96c3313412840,0b0d6095c5555fe083844281f6b093bb,canceled,2018-08-31 16:13:44,NaN,NaN,NaN,2018-10-01 00:00:00
99313,e9e64a17afa9653aacf2616d94c005b8,b4cd0522e632e481f8eaf766a2646e86,processing,2018-01-05 23:07:24,2018-01-09 07:18:05,NaN,NaN,2018-02-06 00:00:00
99347,a89abace0dcc01eeb267a9660b5ac126,2f0524a7b1b3845a1a57fcf3910c4333,canceled,2018-09-06 18:45:47,NaN,NaN,NaN,2018-09-27 00:00:00
99348,a69ba794cc7deb415c3e15a0a3877e69,726f0894b5becdf952ea537d5266e543,unavailable,2017-08-23 16:28:04,2017-08-28 15:44:47,NaN,NaN,2017-09-15 00:00:00
99415,5fabc81b6322c8443648e1b21a6fef21,32c9df889d41b0ee8309a5efb6855dcb,unavailable,2017-10-10 10:50:03,2017-10-14 18:35:57,NaN,NaN,2017-10-23 00:00:00

In [30]:
orders_df['order_status'].value_counts()

order_status
delivered      96478
shipped         1107
canceled         625
unavailable      609
invoiced         314
processing       301
created            5
approved           2
Name: count, dtype: int64

In [31]:
if orders_df.duplicated().any():
    print("There are duplicate records in orders_df")
else:
    print("There are no duplicate records in orders_df")

There are no duplicate records in orders_df

In [32]:
orders_df.to_sql(name="orders",con=engine,if_exists='replace',index=False)

99441

<h3> Analyzing Payments Data

In [33]:
print(payments_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB
None

In [34]:
payments_df.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [35]:
payments_df.isnull().any()

order_id                False
payment_sequential      False
payment_type            False
payment_installments    False
payment_value           False
dtype: bool

In [36]:
if payments_df.duplicated().any():
    print("There are duplicate records in payments_df")
else:
    print("There are no duplicate records in payments_df")

There are no duplicate records in payments_df

In [37]:
payments_df.to_sql(name="payments",con=engine,if_exists='replace',index=False)

103886

<h3> Analyzing Products Data

In [38]:
print(products_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product category            32341 non-null  object
 2   product_name_length         32341 non-null  float64
 3   product_description_length  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB
None

In [39]:
products_df.head()

,product_id,product category,product_name_length,product_description_length,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumery,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,Art,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,sport leisure,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,babies,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,housewares,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [40]:
products_df.columns = products_df.columns.str.replace(" ","_")

In [41]:
products_df.isnull().any()

product_id                    False
product_category               True
product_name_length            True
product_description_length     True
product_photos_qty             True
product_weight_g               True
product_length_cm              True
product_height_cm              True
product_width_cm               True
dtype: bool

In [42]:
products_df['product_category'].isnull().sum()

np.int64(610)

In [43]:
products_df[products_df['product_category'].isnull()]

,product_id,product_category,product_name_length,product_description_length,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
105,a41e356c76fab66334f36de622ecbd3a,NaN,NaN,NaN,NaN,650.0,17.0,14.0,12.0
128,d8dee61c2034d6d075997acef1870e9b,NaN,NaN,NaN,NaN,300.0,16.0,7.0,20.0
145,56139431d72cd51f19eb9f7dae4d1617,NaN,NaN,NaN,NaN,200.0,20.0,20.0,20.0
154,46b48281eb6d663ced748f324108c733,NaN,NaN,NaN,NaN,18500.0,41.0,30.0,41.0
197,5fb61f482620cb672f5e586bb132eae9,NaN,NaN,NaN,NaN,300.0,35.0,7.0,12.0
...,...,...,...,...,...,...,...,...,...
32515,b0a0c5dd78e644373b199380612c350a,NaN,NaN,NaN,NaN,1800.0,30.0,20.0,70.0
32589,10dbe0fbaa2c505123c17fdc34a63c56,NaN,NaN,NaN,NaN,800.0,30.0,10.0,23.0
32616,bd2ada37b58ae94cc838b9c0569fecd8,NaN,NaN,NaN,NaN,200.0,21.0,8.0,16.0
32772,fa51e914046aab32764c41356b9d4ea4,NaN,NaN,NaN,NaN,1300.0,45.0,16.0,45.0
32852,c4ceee876c82b8328e9c293fa0e1989b,NaN,NaN,NaN,NaN,700.0,28.0,3.0,43.0

In [44]:
if products_df.duplicated().any():
    print("There are duplicate records in products_df")
else:
    print("There are no duplicate records in products_df")

There are no duplicate records in products_df

In [45]:
products_df.to_sql(name="products",con=engine,if_exists='replace',index=False)

32951

<h3> Analyzing Sellers Data

In [46]:
print(sellers_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   int64
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB
None

In [47]:
sellers_df.head()

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,braganca paulista,SP

In [48]:
sellers_df.isnull().any()

seller_id                 False
seller_zip_code_prefix    False
seller_city               False
seller_state              False
dtype: bool

In [49]:
if sellers_df.duplicated().any():
    print("There are duplicate records in sellers_df")
else:
    print("There are no duplicate records in sellers_df")

There are no duplicate records in sellers_df

In [50]:
sellers_df.to_sql(name="sellers",con=engine,if_exists='replace',index=False)

3095

<h3> Insights as per the Requirement Document

1. List all unique cities where customers are located.

In [51]:
df1 = pd.read_sql("""select distinct(upper(customer_city)) as 'Customer Cities'
                  from customers;""",con=engine)

df1

            Customer Cities
0                    FRANCA
1     SAO BERNARDO DO CAMPO
2                 SAO PAULO
3           MOGI DAS CRUZES
4                  CAMPINAS
...                     ...
4114                 SIRIJI
4115    NATIVIDADE DA SERRA
4116           MONTE BONITO
4117             SAO RAFAEL
4118      EUGENIO DE CASTRO

[4119 rows x 1 columns]

2. Count the number of orders placed in 2017.

In [52]:
df2 = pd.read_sql("""select count(distinct order_id) as 'Total Orders in 2017'
                  from orders 
                  where year(order_purchase_timestamp) = '2017'""",con=engine)

df2

   Total Orders in 2017
0                 45101

3. Find the total sales per category.

In [53]:
df3 = pd.read_sql("""select UPPER(products.product_category) as 'Category', round(sum(payments.payment_value),2) as 'Total Sales' 
                  from products join order_items 
                  on products.product_id = order_items.product_id
                  join payments
                  on payments.order_id = order_items.order_id
                  group by Category;""",con=engine)

df3.head(10)

               Category  Total Sales
0             PERFUMERY    506738.66
1  FURNITURE DECORATION   1430176.39
2             TELEPHONY    486882.05
3        BED TABLE BATH   1712553.67
4            AUTOMOTIVE    852294.33
5  COMPUTER ACCESSORIES   1585330.45
6            HOUSEWARES   1094758.13
7                BABIES    539845.66
8                  TOYS    619037.69
9      FURNITURE OFFICE    646826.49

4. Calculate the percentage of orders that were paid in installments.

In [54]:
df4 = pd.read_sql("""select count(case when payments.payment_installments > 0 then orders.order_id end) * 100 / count(orders.order_id) as 'Percentage of Orders Paid in Installments'
                  from orders join payments
                  on orders.order_id = payments.order_id""",con=engine)

df4

   Percentage of Orders Paid in Installments
0                                    99.9981

5. Count the number of customers from each state.

In [55]:
df5 = pd.read_sql("""select customer_state as 'State', count(distinct customer_id) as 'No. of Customers'
                  from customers
                  group by State""",con=engine)

df5

   State  No. of Customers
0     AC                81
1     AL               413
2     AM               148
3     AP                68
4     BA              3380
5     CE              1336
6     DF              2140
7     ES              2033
8     GO              2020
9     MA               747
10    MG             11635
11    MS               715
12    MT               907
13    PA               975
14    PB               536
15    PE              1652
16    PI               495
17    PR              5045
18    RJ             12852
19    RN               485
20    RO               253
21    RR                46
22    RS              5466
23    SC              3637
24    SE               350
25    SP             41746
26    TO               280

6. Calculate the number of orders per month in 2018.

In [56]:
df6 = pd.read_sql("""select monthname(order_purchase_timestamp) as 'Months_of_2018',count(order_id) as 'No. of Orders'
                  from orders
                  where year(order_purchase_timestamp) = 2018
                  group by Months_of_2018""",con=engine)

df6

  Months_of_2018  No. of Orders
0           July           6292
1         August           6512
2       February           6728
3           June           6167
4          March           7211
5        January           7269
6            May           6873
7          April           6939
8      September             16
9        October              4

7. Find the average number of products per order, grouped by customer city.

In [57]:
df7 = pd.read_sql("""with count_per_order as 
                  (select orders.order_id,orders.customer_id,count(order_item_id) as oc
                  from order_items join orders
                  on order_items.order_id = orders.order_id
                  group by orders.order_id,orders.customer_id)
                  
                  select upper(customers.customer_city) as 'Customer City',round(avg(count_per_order.oc),2) as 'Avg No. of Products per order'
                  from customers join count_per_order 
                  on customers.customer_id = count_per_order.customer_id
                  group by customers.customer_city
                  order by round(avg(count_per_order.oc),2) DESC""", con=engine)

df7.head(10)

        Customer City  Avg No. of Products per order
0      PADRE CARVALHO                            7.0
1         CELSO RAMOS                            6.5
2               DATAS                            6.0
3       CANDIDO GODOI                            6.0
4      MATIAS OLIMPIO                            5.0
5  MORRO DE SAO PAULO                            4.0
6     TEIXEIRA SOARES                            4.0
7          CURRALINHO                            4.0
8          CIDELANDIA                            4.0
9             PICARRA                            4.0

8. Calculate the percentage of total revenue contributed by each product category.

In [58]:
df8 = pd.read_sql("""select products.product_category as 'category',round(round(sum(payments.payment_value),2) * 100/ (select round(sum(payments.payment_value),2) from payments),2) as 'percentage_of_total_sales'
                  from order_items join payments
                  on payments.order_id = order_items.order_id
                  join products
                  on order_items.product_id = products.product_id
                  group by category
                  order by percentage_of_total_sales desc""",con=engine)

df8.head(10)

               category  percentage_of_total_sales
0        bed table bath                      10.70
1         HEALTH BEAUTY                      10.35
2  computer accessories                       9.90
3  Furniture Decoration                       8.93
4       Watches present                       8.93
5         sport leisure                       8.70
6            housewares                       6.84
7            automotive                       5.32
8          Garden tools                       5.24
9            Cool Stuff                       4.87

9. Identify the correlation between product price and the number of times a product has been purchased.

In [59]:
df9 = pd.read_sql("""select products.product_category,count(order_items.order_item_id) as 'no_of_items_sold',round(avg(order_items.price),2) as 'product_price'
                  from products join order_items
                  on products.product_id = order_items.product_id
                  group by products.product_category""", con=engine)

df9

                   product_category  no_of_items_sold  product_price
0                     HEALTH BEAUTY              9670         130.16
1                     sport leisure              8641         114.34
2                        Cool Stuff              3796         167.36
3              computer accessories              7827         116.51
4                   Watches present              5991         201.14
..                              ...               ...            ...
69                          flowers                33          33.64
70  Kitchen portable and food coach                15         264.57
71                  House Comfort 2                30          25.34
72       CITTE AND UPHACK FURNITURE                38         114.95
73                   cds music dvds                14          52.14

[74 rows x 3 columns]

In [60]:
# To check the correlation between Product Price and Number of Items Sold

df9_data = df9.loc[:,['no_of_items_sold','product_price']]

correlation_matrix = df9_data.corr()
correlation_matrix

# -1 means inversely proportional
# 0 means no correlation
# +1 means directly proportional

                  no_of_items_sold  product_price
no_of_items_sold          1.000000      -0.106315
product_price            -0.106315       1.000000

10. Calculate the total revenue generated by each seller, and rank them by revenue.

In [61]:
df10 = pd.read_sql("""select sellers.seller_id, round(sum(payments.payment_value),2) as 'total_revenue'
                   from sellers join order_items
                   on sellers.seller_id = order_items.seller_id
                   join payments
                   on order_items.order_id = payments.order_id
                   group by sellers.seller_id
                   order by total_revenue desc""", con=engine)

df10.head(10)

                          seller_id  total_revenue
0  7c67e1448b00f6e969d365cea6b010ab      507166.91
1  1025f0e2d44d7041d6cf58b6550e0bfa      308222.04
2  4a3ca9315b744ce9f8e9374361493884      301245.27
3  1f50f920176fa81dab994f9023523100      290253.42
4  53243585a1d6dc2643021fd1853d8905      284903.08
5  da8622b14eb17ae2831f4ac5b9dab84a      272219.32
6  4869f7a5dfa277a7dca6462dcf3b52b2      264166.12
7  955fee9216a65b617aa5c0531780ce60      236322.30
8  fa1c13f2614d7b5c4749cbc52fecda94      206513.23
9  7e93a43ef30c4f03f38b393420bc753a      185134.21

11. Calculate the moving average of order values for each customer over their order history.

In [62]:
df11 = pd.read_sql("""select customer_id, order_purchase_timestamp, payment, avg(payment) over (partition by customer_id order by order_purchase_timestamp rows between unbounded preceding and current row) as 'moving_avg'
                   from 
                   (select orders.customer_id, orders.order_purchase_timestamp, payments.payment_value as 'payment'
                   from orders join payments
                   on orders.order_id = payments.order_id) as a""",con=engine)

df11

,customer_id,order_purchase_timestamp,payment,moving_avg
0,00012a2ce6f8dcda20d059ce98491703,2017-11-14 16:08:26,114.74,114.74
1,000161a058600d5901f007fab4c27140,2017-07-16 09:40:32,67.41,67.41
2,0001fd6190edaaf884bcaf3d49edf079,2017-02-28 11:06:43,195.42,195.42
3,0002414f95344307404f0ace7a26f1d5,2017-08-16 13:09:20,179.35,179.35
4,000379cdec625522490c315e70c7a9fb,2018-04-02 13:42:17,107.01,107.01
...,...,...,...,...
103881,fffecc9f79fd8c764f843e9951b11341,2018-03-29 16:59:26,9.49,27.12
103882,fffeda5b6d849fbd39689bb92087f431,2018-05-22 13:36:02,63.13,63.13
103883,ffff42319e9b2d713724ae527742af25,2018-06-13 16:57:05,214.13,214.13
103884,ffffa3172527f765de70084a7e53aae8,2017-09-02 11:53:32,45.50,45.50
103885,ffffe8b65bbe3087b653a978c870db99,2017-09-29 14:07:03,18.37,18.37

12. Calculate the cumulative sales per month for each year.

In [63]:
df12 = pd.read_sql("""select years,months,payments,round(sum(payments) over (order by years,months),2) as 'cumulative_sales'
                   from 
                   (select year(orders.order_purchase_timestamp) as 'years',month(orders.order_purchase_timestamp) as 'months', round(sum(payments.payment_value),2) as 'payments'
                   from orders join payments
                   on orders.order_id = payments.order_id
                   group by years,months
                   order by years,months) as a""",con=engine)

df12

    years  months    payments  cumulative_sales
0    2016       9      252.24            252.24
1    2016      10    59090.48          59342.72
2    2016      12       19.62          59362.34
3    2017       1   138488.04         197850.38
4    2017       2   291908.01         489758.39
5    2017       3   449863.60         939621.99
6    2017       4   417788.03        1357410.02
7    2017       5   592918.82        1950328.84
8    2017       6   511276.38        2461605.22
9    2017       7   592382.92        3053988.14
10   2017       8   674396.32        3728384.46
11   2017       9   727762.45        4456146.91
12   2017      10   779677.88        5235824.79
13   2017      11  1194882.80        6430707.59
14   2017      12   878401.48        7309109.07
15   2018       1  1115004.18        8424113.25
16   2018       2   992463.34        9416576.59
17   2018       3  1159652.12       10576228.71
18   2018       4  1160785.48       11737014.19
19   2018       5  1153982.15       12890996.34
20   2018       6  1023880.50       13914876.84
21   2018       7  1066540.75       14981417.59
22   2018       8  1022425.32       16003842.91
23   2018       9     4439.54       16008282.45
24   2018      10      589.67       16008872.12

13. Calculate the year-over-year growth rate of total sales.

In [66]:
df13 = pd.read_sql("""with cte as 
                   (select year(orders.order_purchase_timestamp) as 'years', round(sum(payments.payment_value),2) as 'payments'
                   from orders join payments
                   on orders.order_id = payments.order_id
                   group by years)
                   select years, round(((payments - lag(payments) over (order by years))/lag(payments) over (order by years)) * 100,2) as 'yoy_growth_rate'
                   from cte""",con=engine)

df13

   years  yoy_growth_rate
0   2016              NaN
1   2017          12112.7
2   2018             20.0

14. Calculate the retention rate of customers, defined as the percentage of customers who make another purchase within 6 months of their first purchase.

In [68]:
df14 = pd.read_sql("""with cte1 as 
                   (select customers.customer_id,min(orders.order_purchase_timestamp) as 'first_order'
                   from customers join orders
                   on customers.customer_id = orders.customer_id
                   group by customers.customer_id), 
                   cte2 as 
                   (select cte1.customer_id,count(distinct orders.order_purchase_timestamp)
                   from cte1 join orders
                   on cte1.customer_id = orders.customer_id
                   and orders.order_purchase_timestamp > first_order
                   and orders.order_purchase_timestamp < date_add(first_order, interval 6 month)
                   group by cte1.customer_id)
                   select 100 * count(distinct cte1.customer_id)/count(distinct cte2.customer_id) as 'customer_retention_rate'
                   from cte1 left join cte2
                   on cte1.customer_id = cte2.customer_id""",con=engine)

df14

  customer_retention_rate
0                    None

15. Identify the top 3 customers who spent the most money in each year.

In [70]:
df15 = pd.read_sql("""select years, customer_id,payment,ranks
                   from (select year(orders.order_purchase_timestamp) as 'years', orders.customer_id,sum(payments.payment_value) as 'payment', dense_rank() over (partition by year(orders.order_purchase_timestamp) order by sum(payments.payment_value) desc) as 'ranks'
                   from orders join payments
                   on orders.order_id = payments.order_id
                   group by years,orders.customer_id) as a
                   where ranks<=3""",con=engine)

df15

   years                       customer_id   payment  ranks
0   2016  a9dc96b027d1252bbac0a9b72d837fc6   1423.55      1
1   2016  1d34ed25963d5aae4cf3d7f3a4cda173   1400.74      2
2   2016  4a06381959b6670756de02e07b83815f   1227.78      3
3   2017  1617b1357756262bfa56ab541c47bc16  13664.08      1
4   2017  c6e2731c5b391845f6800c97401a43a9   6929.31      2
5   2017  3fd6777bbce08a352fddd04e4a7cc8f6   6726.66      3
6   2018  ec5b2ba62e574342386871631fafd3fc   7274.88      1
7   2018  f48d464a0baaea338cb25f816991ab1f   6922.21      2
8   2018  e0a2412720e9ea4f26c1ac985f6a7358   4809.44      3